/*
题目描述 
质数（prime number）又称素数，有无限个，质数定义为在大于1的自然数中，除了1和它本身以外不再有其他因数。
例如小于10的质数有2，3，5，7。
输入描述:
第一行输入一个整数T，表示询问的个数
接下来T行每行输入一个整数n.
1<=T<=1e8,1<=n<=1000000

输出描述:
对于每个询问n输出小于等于n的的质数的个数。

示例1
输入
2
10
1000000
输出
4
78498
*/

#include<stdio.h>
int a[1000001] = { 0 };
int main()
{
    int i, j, n;
    for (i = 2; i <= 1000; i++)
    {
        for (j = i * i; j <= 1000000; j += i)
            a[j] = 1;
    }
    for (i = 2; i <= 1000000; i++)
    {
        if (!a[i])
            a[i] = a[i - 1] + 1;
        else
            a[i] = a[i - 1];
    }
    int t;
    scanf("%d", &t);
    while (t--)
    {
        scanf("%d", &n);
        printf("%d\n", a[n]);
    }
    return 0;
}
